---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RebarHandleNameData Properties
RebarHandleNameData Class See Also Send Feedback
---

The RebarHandleNameData type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

RebarHandleNameData Class

Autodesk.Revit.DB.Structure Namespace